virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
/* -------- HSMC_TIMINGS : (SMC Offset: 0x0C) (R/W 32) Timings Register -------- */
#define HSMC_TIMINGS_TCLR_Pos                 _U_(0)                                               /**< (HSMC_TIMINGS) CLE to REN Low Delay Position */
#define HSMC_TIMINGS_TCLR_Msk                 (_U_(0xF) << HSMC_TIMINGS_TCLR_Pos)                  /**< (HSMC_TIMINGS) CLE to REN Low Delay Mask */
#define HSMC_TIMINGS_TCLR(value)              (HSMC_TIMINGS_TCLR_Msk & ((value) << HSMC_TIMINGS_TCLR_Pos))
#define HSMC_TIMINGS_TADL_Pos                 _U_(4)                                               /**< (HSMC_TIMINGS) ALE to Data Start Position */
#define HSMC_TIMINGS_TADL_Msk                 (_U_(0xF) << HSMC_TIMINGS_TADL_Pos)                  /**< (HSMC_TIMINGS) ALE to Data Start Mask */
#define HSMC_TIMINGS_TADL(value)              (HSMC_TIMINGS_TADL_Msk & ((value) << HSMC_TIMINGS_TADL_Pos))
#define HSMC_TIMINGS_TAR_Pos                  _U_(8)                                               /**< (HSMC_TIMINGS) ALE to REN Low Delay Position */
#define HSMC_TIMINGS_TAR_Msk                  (_U_(0xF) << HSMC_TIMINGS_TAR_Pos)                   /**< (HSMC_TIMINGS) ALE to REN Low Delay Mask */
#define HSMC_TIMINGS_TAR(value)               (HSMC_TIMINGS_TAR_Msk & ((value) << HSMC_TIMINGS_TAR_Pos))
#define HSMC_TIMINGS_OCMS_Pos                 _U_(12)                                              /**< (HSMC_TIMINGS) Off Chip Memory Scrambling Enable Position */
#define HSMC_TIMINGS_OCMS_Msk                 (_U_(0x1) << HSMC_TIMINGS_OCMS_Pos)                  /**< (HSMC_TIMINGS) Off Chip Memory Scrambling Enable Mask */
#define HSMC_TIMINGS_OCMS(value)              (HSMC_TIMINGS_OCMS_Msk & ((value) << HSMC_TIMINGS_OCMS_Pos))
#define HSMC_TIMINGS_TRR_Pos                  _U_(16)                                              /**< (HSMC_TIMINGS) Ready to REN Low Delay Position */
#define HSMC_TIMINGS_TRR_Msk                  (_U_(0xF) << HSMC_TIMINGS_TRR_Pos)                   /**< (HSMC_TIMINGS) Ready to REN Low Delay Mask */
#define HSMC_TIMINGS_TRR(value)               (HSMC_TIMINGS_TRR_Msk & ((value) << HSMC_TIMINGS_TRR_Pos))
#define HSMC_TIMINGS_TWB_Pos                  _U_(24)                                              /**< (HSMC_TIMINGS) WEN High to REN to Busy Position */
#define HSMC_TIMINGS_TWB_Msk                  (_U_(0xF) << HSMC_TIMINGS_TWB_Pos)                   /**< (HSMC_TIMINGS) WEN High to REN to Busy Mask */
#define HSMC_TIMINGS_TWB(value)               (HSMC_TIMINGS_TWB_Msk & ((value) << HSMC_TIMINGS_TWB_Pos))
#define HSMC_TIMINGS_NFSEL_Pos                _U_(31)                                              /**< (HSMC_TIMINGS) NAND Flash Selection Position */
#define HSMC_TIMINGS_NFSEL_Msk                (_U_(0x1) << HSMC_TIMINGS_NFSEL_Pos)                 /**< (HSMC_TIMINGS) NAND Flash Selection Mask */
#define HSMC_TIMINGS_NFSEL(value)             (HSMC_TIMINGS_NFSEL_Msk & ((value) << HSMC_TIMINGS_NFSEL_Pos))
#define HSMC_TIMINGS_Msk                      _U_(0x8F0F1FFF)                                      /**< (HSMC_TIMINGS) Register Mask  */


/* -------- HSMC_MODE : (SMC Offset: 0x10) (R/W 32) Mode Register -------- */
#define HSMC_MODE_READ_MODE_Pos               _U_(0)                                               /**< (HSMC_MODE) Selection of the Control Signal for Read Operation Position */
#define HSMC_MODE_READ_MODE_Msk               (_U_(0x1) << HSMC_MODE_READ_MODE_Pos)                /**< (HSMC_MODE) Selection of the Control Signal for Read Operation Mask */
#define HSMC_MODE_READ_MODE(value)            (HSMC_MODE_READ_MODE_Msk & ((value) << HSMC_MODE_READ_MODE_Pos))
#define   HSMC_MODE_READ_MODE_NCS_CTRL_Val    _U_(0x0)                                             /**< (HSMC_MODE) The Read operation is controlled by the NCS signal.  */
#define   HSMC_MODE_READ_MODE_NRD_CTRL_Val    _U_(0x1)                                             /**< (HSMC_MODE) The Read operation is controlled by the NRD signal.  */
#define HSMC_MODE_READ_MODE_NCS_CTRL          (HSMC_MODE_READ_MODE_NCS_CTRL_Val << HSMC_MODE_READ_MODE_Pos) /**< (HSMC_MODE) The Read operation is controlled by the NCS signal. Position  */
#define HSMC_MODE_READ_MODE_NRD_CTRL          (HSMC_MODE_READ_MODE_NRD_CTRL_Val << HSMC_MODE_READ_MODE_Pos) /**< (HSMC_MODE) The Read operation is controlled by the NRD signal. Position  */
#define HSMC_MODE_WRITE_MODE_Pos              _U_(1)                                               /**< (HSMC_MODE) Selection of the Control Signal for Write Operation Position */
#define HSMC_MODE_WRITE_MODE_Msk              (_U_(0x1) << HSMC_MODE_WRITE_MODE_Pos)               /**< (HSMC_MODE) Selection of the Control Signal for Write Operation Mask */
#define HSMC_MODE_WRITE_MODE(value)           (HSMC_MODE_WRITE_MODE_Msk & ((value) << HSMC_MODE_WRITE_MODE_Pos))
#define   HSMC_MODE_WRITE_MODE_NCS_CTRL_Val   _U_(0x0)                                             /**< (HSMC_MODE) The Write operation is controller by the NCS signal.  */
#define   HSMC_MODE_WRITE_MODE_NWE_CTRL_Val   _U_(0x1)                                             /**< (HSMC_MODE) The Write operation is controlled by the NWE signal  */
#define HSMC_MODE_WRITE_MODE_NCS_CTRL         (HSMC_MODE_WRITE_MODE_NCS_CTRL_Val << HSMC_MODE_WRITE_MODE_Pos) /**< (HSMC_MODE) The Write operation is controller by the NCS signal. Position  */
#define HSMC_MODE_WRITE_MODE_NWE_CTRL         (HSMC_MODE_WRITE_MODE_NWE_CTRL_Val << HSMC_MODE_WRITE_MODE_Pos) /**< (HSMC_MODE) The Write operation is controlled by the NWE signal Position  */
#define HSMC_MODE_EXNW_MODE_Pos               _U_(4)                                               /**< (HSMC_MODE) NWAIT Mode Position */
#define HSMC_MODE_EXNW_MODE_Msk               (_U_(0x3) << HSMC_MODE_EXNW_MODE_Pos)                /**< (HSMC_MODE) NWAIT Mode Mask */
#define HSMC_MODE_EXNW_MODE(value)            (HSMC_MODE_EXNW_MODE_Msk & ((value) << HSMC_MODE_EXNW_MODE_Pos))
#define   HSMC_MODE_EXNW_MODE_DISABLED_Val    _U_(0x0)                                             /**< (HSMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding Chip Select.  */
#define   HSMC_MODE_EXNW_MODE_FROZEN_Val      _U_(0x2)                                             /**< (HSMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.  */
#define   HSMC_MODE_EXNW_MODE_READY_Val       _U_(0x3)                                             /**< (HSMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.  */
#define HSMC_MODE_EXNW_MODE_DISABLED          (HSMC_MODE_EXNW_MODE_DISABLED_Val << HSMC_MODE_EXNW_MODE_Pos) /**< (HSMC_MODE) Disabled-The NWAIT input signal is ignored on the corresponding Chip Select. Position  */
#define HSMC_MODE_EXNW_MODE_FROZEN            (HSMC_MODE_EXNW_MODE_FROZEN_Val << HSMC_MODE_EXNW_MODE_Pos) /**< (HSMC_MODE) Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped. Position  */
#define HSMC_MODE_EXNW_MODE_READY             (HSMC_MODE_EXNW_MODE_READY_Val << HSMC_MODE_EXNW_MODE_Pos) /**< (HSMC_MODE) Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high. Position  */
#define HSMC_MODE_BAT_Pos                     _U_(8)                                               /**< (HSMC_MODE) Byte Access Type Position */
#define HSMC_MODE_BAT_Msk                     (_U_(0x1) << HSMC_MODE_BAT_Pos)                      /**< (HSMC_MODE) Byte Access Type Mask */
#define HSMC_MODE_BAT(value)                  (HSMC_MODE_BAT_Msk & ((value) << HSMC_MODE_BAT_Pos))
#define   HSMC_MODE_BAT_BYTE_SELECT_Val       _U_(0x0)                                             /**< (HSMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.  */
#define   HSMC_MODE_BAT_BYTE_WRITE_Val        _U_(0x1)                                             /**< (HSMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.  */
#define HSMC_MODE_BAT_BYTE_SELECT             (HSMC_MODE_BAT_BYTE_SELECT_Val << HSMC_MODE_BAT_Pos) /**< (HSMC_MODE) Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1. Position  */
#define HSMC_MODE_BAT_BYTE_WRITE              (HSMC_MODE_BAT_BYTE_WRITE_Val << HSMC_MODE_BAT_Pos)  /**< (HSMC_MODE) Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD. Position  */
#define HSMC_MODE_DBW_Pos                     _U_(12)                                              /**< (HSMC_MODE) Data Bus Width Position */
#define HSMC_MODE_DBW_Msk                     (_U_(0x1) << HSMC_MODE_DBW_Pos)                      /**< (HSMC_MODE) Data Bus Width Mask */
#define HSMC_MODE_DBW(value)                  (HSMC_MODE_DBW_Msk & ((value) << HSMC_MODE_DBW_Pos))
#define   HSMC_MODE_DBW_BIT_8_Val             _U_(0x0)                                             /**< (HSMC_MODE) 8-bit bus  */
#define   HSMC_MODE_DBW_BIT_16_Val            _U_(0x1)                                             /**< (HSMC_MODE) 16-bit bus  */
#define HSMC_MODE_DBW_BIT_8                   (HSMC_MODE_DBW_BIT_8_Val << HSMC_MODE_DBW_Pos)       /**< (HSMC_MODE) 8-bit bus Position  */
#define HSMC_MODE_DBW_BIT_16                  (HSMC_MODE_DBW_BIT_16_Val << HSMC_MODE_DBW_Pos)      /**< (HSMC_MODE) 16-bit bus Position  */
#define HSMC_MODE_TDF_CYCLES_Pos              _U_(16)                                              /**< (HSMC_MODE) Data Float Time Position */
#define HSMC_MODE_TDF_CYCLES_Msk              (_U_(0xF) << HSMC_MODE_TDF_CYCLES_Pos)               /**< (HSMC_MODE) Data Float Time Mask */
#define HSMC_MODE_TDF_CYCLES(value)           (HSMC_MODE_TDF_CYCLES_Msk & ((value) << HSMC_MODE_TDF_CYCLES_Pos))
#define HSMC_MODE_TDF_MODE_Pos                _U_(20)                                              /**< (HSMC_MODE) TDF Optimization Position */
#define HSMC_MODE_TDF_MODE_Msk                (_U_(0x1) << HSMC_MODE_TDF_MODE_Pos)                 /**< (HSMC_MODE) TDF Optimization Mask */
#define HSMC_MODE_TDF_MODE(value)             (HSMC_MODE_TDF_MODE_Msk & ((value) << HSMC_MODE_TDF_MODE_Pos))
#define HSMC_MODE_Msk                         _U_(0x001F1133)                                      /**< (HSMC_MODE) Register Mask  */


/* -------- HSMC_PMECC : (SMC Offset: 0x00) ( R/ 32) PMECC Redundancy 0 Register (sec_num = 0) -------- */
#define HSMC_PMECC_ECC_Pos                    _U_(0)                                               /**< (HSMC_PMECC) BCH Redundancy Position */
#define HSMC_PMECC_ECC_Msk                    (_U_(0xFFFFFFFF) << HSMC_PMECC_ECC_Pos)              /**< (HSMC_PMECC) BCH Redundancy Mask */
#define HSMC_PMECC_ECC(value)                 (HSMC_PMECC_ECC_Msk & ((value) << HSMC_PMECC_ECC_Pos))
#define HSMC_PMECC_Msk                        _U_(0xFFFFFFFF)                                      /**< (HSMC_PMECC) Register Mask  */


/* -------- HSMC_REM0_ : (SMC Offset: 0x00) ( R/ 32) PMECC Remainder 0 Register (sec_num = 0) -------- */
#define HSMC_REM0__REM2NP1_Pos                _U_(0)                                               /**< (HSMC_REM0_) BCH Remainder 2 * N + 1 Position */
#define HSMC_REM0__REM2NP1_Msk                (_U_(0x3FFF) << HSMC_REM0__REM2NP1_Pos)              /**< (HSMC_REM0_) BCH Remainder 2 * N + 1 Mask */
#define HSMC_REM0__REM2NP1(value)             (HSMC_REM0__REM2NP1_Msk & ((value) << HSMC_REM0__REM2NP1_Pos))
#define HSMC_REM0__REM2NP3_Pos                _U_(16)                                              /**< (HSMC_REM0_) BCH Remainder 2 * N + 3 Position */
#define HSMC_REM0__REM2NP3_Msk                (_U_(0x3FFF) << HSMC_REM0__REM2NP3_Pos)              /**< (HSMC_REM0_) BCH Remainder 2 * N + 3 Mask */
#define HSMC_REM0__REM2NP3(value)             (HSMC_REM0__REM2NP3_Msk & ((value) << HSMC_REM0__REM2NP3_Pos))
#define HSMC_REM0__Msk                        _U_(0x3FFF3FFF)                                      /**< (HSMC_REM0_) Register Mask  */


