virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
#define HSMC_SR_RB_EDGE_Pos                   _U_(24)                                              /**< (HSMC_SR Position) Ready/Busy Line x Edge Detected */
#define HSMC_SR_RB_EDGE_Msk                   (_U_(0x1) << HSMC_SR_RB_EDGE_Pos)                    /**< (HSMC_SR Mask) RB_EDGE */
#define HSMC_SR_RB_EDGE(value)                (HSMC_SR_RB_EDGE_Msk & ((value) << HSMC_SR_RB_EDGE_Pos)) 

/* -------- HSMC_IER : (SMC Offset: 0x0C) ( /W 32) NFC Interrupt Enable Register -------- */
#define HSMC_IER_RB_RISE_Pos                  _U_(4)                                               /**< (HSMC_IER) Ready Busy Rising Edge Detection Interrupt Enable Position */
#define HSMC_IER_RB_RISE_Msk                  (_U_(0x1) << HSMC_IER_RB_RISE_Pos)                   /**< (HSMC_IER) Ready Busy Rising Edge Detection Interrupt Enable Mask */
#define HSMC_IER_RB_RISE(value)               (HSMC_IER_RB_RISE_Msk & ((value) << HSMC_IER_RB_RISE_Pos))
#define HSMC_IER_RB_FALL_Pos                  _U_(5)                                               /**< (HSMC_IER) Ready Busy Falling Edge Detection Interrupt Enable Position */
#define HSMC_IER_RB_FALL_Msk                  (_U_(0x1) << HSMC_IER_RB_FALL_Pos)                   /**< (HSMC_IER) Ready Busy Falling Edge Detection Interrupt Enable Mask */
#define HSMC_IER_RB_FALL(value)               (HSMC_IER_RB_FALL_Msk & ((value) << HSMC_IER_RB_FALL_Pos))
#define HSMC_IER_XFRDONE_Pos                  _U_(16)                                              /**< (HSMC_IER) Transfer Done Interrupt Enable Position */
#define HSMC_IER_XFRDONE_Msk                  (_U_(0x1) << HSMC_IER_XFRDONE_Pos)                   /**< (HSMC_IER) Transfer Done Interrupt Enable Mask */
#define HSMC_IER_XFRDONE(value)               (HSMC_IER_XFRDONE_Msk & ((value) << HSMC_IER_XFRDONE_Pos))
#define HSMC_IER_CMDDONE_Pos                  _U_(17)                                              /**< (HSMC_IER) Command Done Interrupt Enable Position */
#define HSMC_IER_CMDDONE_Msk                  (_U_(0x1) << HSMC_IER_CMDDONE_Pos)                   /**< (HSMC_IER) Command Done Interrupt Enable Mask */
#define HSMC_IER_CMDDONE(value)               (HSMC_IER_CMDDONE_Msk & ((value) << HSMC_IER_CMDDONE_Pos))
#define HSMC_IER_DTOE_Pos                     _U_(20)                                              /**< (HSMC_IER) Data Timeout Error Interrupt Enable Position */
#define HSMC_IER_DTOE_Msk                     (_U_(0x1) << HSMC_IER_DTOE_Pos)                      /**< (HSMC_IER) Data Timeout Error Interrupt Enable Mask */
#define HSMC_IER_DTOE(value)                  (HSMC_IER_DTOE_Msk & ((value) << HSMC_IER_DTOE_Pos))
#define HSMC_IER_UNDEF_Pos                    _U_(21)                                              /**< (HSMC_IER) Undefined Area Access Interrupt Enable Position */
#define HSMC_IER_UNDEF_Msk                    (_U_(0x1) << HSMC_IER_UNDEF_Pos)                     /**< (HSMC_IER) Undefined Area Access Interrupt Enable Mask */
#define HSMC_IER_UNDEF(value)                 (HSMC_IER_UNDEF_Msk & ((value) << HSMC_IER_UNDEF_Pos))
#define HSMC_IER_AWB_Pos                      _U_(22)                                              /**< (HSMC_IER) Accessing While Busy Interrupt Enable Position */
#define HSMC_IER_AWB_Msk                      (_U_(0x1) << HSMC_IER_AWB_Pos)                       /**< (HSMC_IER) Accessing While Busy Interrupt Enable Mask */
#define HSMC_IER_AWB(value)                   (HSMC_IER_AWB_Msk & ((value) << HSMC_IER_AWB_Pos))  
#define HSMC_IER_NFCASE_Pos                   _U_(23)                                              /**< (HSMC_IER) NFC Access Size Error Interrupt Enable Position */
#define HSMC_IER_NFCASE_Msk                   (_U_(0x1) << HSMC_IER_NFCASE_Pos)                    /**< (HSMC_IER) NFC Access Size Error Interrupt Enable Mask */
#define HSMC_IER_NFCASE(value)                (HSMC_IER_NFCASE_Msk & ((value) << HSMC_IER_NFCASE_Pos))
#define HSMC_IER_RB_EDGE0_Pos                 _U_(24)                                              /**< (HSMC_IER) Ready/Busy Line 0 Interrupt Enable Position */
#define HSMC_IER_RB_EDGE0_Msk                 (_U_(0x1) << HSMC_IER_RB_EDGE0_Pos)                  /**< (HSMC_IER) Ready/Busy Line 0 Interrupt Enable Mask */
#define HSMC_IER_RB_EDGE0(value)              (HSMC_IER_RB_EDGE0_Msk & ((value) << HSMC_IER_RB_EDGE0_Pos))
#define HSMC_IER_Msk                          _U_(0x01F30030)                                      /**< (HSMC_IER) Register Mask  */

#define HSMC_IER_RB_EDGE_Pos                  _U_(24)                                              /**< (HSMC_IER Position) Ready/Busy Line x Interrupt Enable */
#define HSMC_IER_RB_EDGE_Msk                  (_U_(0x1) << HSMC_IER_RB_EDGE_Pos)                   /**< (HSMC_IER Mask) RB_EDGE */
#define HSMC_IER_RB_EDGE(value)               (HSMC_IER_RB_EDGE_Msk & ((value) << HSMC_IER_RB_EDGE_Pos)) 

/* -------- HSMC_IDR : (SMC Offset: 0x10) ( /W 32) NFC Interrupt Disable Register -------- */
#define HSMC_IDR_RB_RISE_Pos                  _U_(4)                                               /**< (HSMC_IDR) Ready Busy Rising Edge Detection Interrupt Disable Position */
#define HSMC_IDR_RB_RISE_Msk                  (_U_(0x1) << HSMC_IDR_RB_RISE_Pos)                   /**< (HSMC_IDR) Ready Busy Rising Edge Detection Interrupt Disable Mask */
#define HSMC_IDR_RB_RISE(value)               (HSMC_IDR_RB_RISE_Msk & ((value) << HSMC_IDR_RB_RISE_Pos))
#define HSMC_IDR_RB_FALL_Pos                  _U_(5)                                               /**< (HSMC_IDR) Ready Busy Falling Edge Detection Interrupt Disable Position */
#define HSMC_IDR_RB_FALL_Msk                  (_U_(0x1) << HSMC_IDR_RB_FALL_Pos)                   /**< (HSMC_IDR) Ready Busy Falling Edge Detection Interrupt Disable Mask */
#define HSMC_IDR_RB_FALL(value)               (HSMC_IDR_RB_FALL_Msk & ((value) << HSMC_IDR_RB_FALL_Pos))
#define HSMC_IDR_XFRDONE_Pos                  _U_(16)                                              /**< (HSMC_IDR) Transfer Done Interrupt Disable Position */
#define HSMC_IDR_XFRDONE_Msk                  (_U_(0x1) << HSMC_IDR_XFRDONE_Pos)                   /**< (HSMC_IDR) Transfer Done Interrupt Disable Mask */
#define HSMC_IDR_XFRDONE(value)               (HSMC_IDR_XFRDONE_Msk & ((value) << HSMC_IDR_XFRDONE_Pos))
#define HSMC_IDR_CMDDONE_Pos                  _U_(17)                                              /**< (HSMC_IDR) Command Done Interrupt Disable Position */
#define HSMC_IDR_CMDDONE_Msk                  (_U_(0x1) << HSMC_IDR_CMDDONE_Pos)                   /**< (HSMC_IDR) Command Done Interrupt Disable Mask */
#define HSMC_IDR_CMDDONE(value)               (HSMC_IDR_CMDDONE_Msk & ((value) << HSMC_IDR_CMDDONE_Pos))
#define HSMC_IDR_DTOE_Pos                     _U_(20)                                              /**< (HSMC_IDR) Data Timeout Error Interrupt Disable Position */
#define HSMC_IDR_DTOE_Msk                     (_U_(0x1) << HSMC_IDR_DTOE_Pos)                      /**< (HSMC_IDR) Data Timeout Error Interrupt Disable Mask */
#define HSMC_IDR_DTOE(value)                  (HSMC_IDR_DTOE_Msk & ((value) << HSMC_IDR_DTOE_Pos))
#define HSMC_IDR_UNDEF_Pos                    _U_(21)                                              /**< (HSMC_IDR) Undefined Area Access Interrupt Disable Position */
#define HSMC_IDR_UNDEF_Msk                    (_U_(0x1) << HSMC_IDR_UNDEF_Pos)                     /**< (HSMC_IDR) Undefined Area Access Interrupt Disable Mask */
#define HSMC_IDR_UNDEF(value)                 (HSMC_IDR_UNDEF_Msk & ((value) << HSMC_IDR_UNDEF_Pos))
#define HSMC_IDR_AWB_Pos                      _U_(22)                                              /**< (HSMC_IDR) Accessing While Busy Interrupt Disable Position */
#define HSMC_IDR_AWB_Msk                      (_U_(0x1) << HSMC_IDR_AWB_Pos)                       /**< (HSMC_IDR) Accessing While Busy Interrupt Disable Mask */
#define HSMC_IDR_AWB(value)                   (HSMC_IDR_AWB_Msk & ((value) << HSMC_IDR_AWB_Pos))  
#define HSMC_IDR_NFCASE_Pos                   _U_(23)                                              /**< (HSMC_IDR) NFC Access Size Error Interrupt Disable Position */
#define HSMC_IDR_NFCASE_Msk                   (_U_(0x1) << HSMC_IDR_NFCASE_Pos)                    /**< (HSMC_IDR) NFC Access Size Error Interrupt Disable Mask */
#define HSMC_IDR_NFCASE(value)                (HSMC_IDR_NFCASE_Msk & ((value) << HSMC_IDR_NFCASE_Pos))
#define HSMC_IDR_RB_EDGE0_Pos                 _U_(24)                                              /**< (HSMC_IDR) Ready/Busy Line 0 Interrupt Disable Position */
#define HSMC_IDR_RB_EDGE0_Msk                 (_U_(0x1) << HSMC_IDR_RB_EDGE0_Pos)                  /**< (HSMC_IDR) Ready/Busy Line 0 Interrupt Disable Mask */
#define HSMC_IDR_RB_EDGE0(value)              (HSMC_IDR_RB_EDGE0_Msk & ((value) << HSMC_IDR_RB_EDGE0_Pos))
#define HSMC_IDR_Msk                          _U_(0x01F30030)                                      /**< (HSMC_IDR) Register Mask  */

