virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
#define HSMC_IDR_RB_EDGE_Pos                  _U_(24)                                              /**< (HSMC_IDR Position) Ready/Busy Line x Interrupt Disable */
#define HSMC_IDR_RB_EDGE_Msk                  (_U_(0x1) << HSMC_IDR_RB_EDGE_Pos)                   /**< (HSMC_IDR Mask) RB_EDGE */
#define HSMC_IDR_RB_EDGE(value)               (HSMC_IDR_RB_EDGE_Msk & ((value) << HSMC_IDR_RB_EDGE_Pos)) 

/* -------- HSMC_IMR : (SMC Offset: 0x14) ( R/ 32) NFC Interrupt Mask Register -------- */
#define HSMC_IMR_RB_RISE_Pos                  _U_(4)                                               /**< (HSMC_IMR) Ready Busy Rising Edge Detection Interrupt Mask Position */
#define HSMC_IMR_RB_RISE_Msk                  (_U_(0x1) << HSMC_IMR_RB_RISE_Pos)                   /**< (HSMC_IMR) Ready Busy Rising Edge Detection Interrupt Mask Mask */
#define HSMC_IMR_RB_RISE(value)               (HSMC_IMR_RB_RISE_Msk & ((value) << HSMC_IMR_RB_RISE_Pos))
#define HSMC_IMR_RB_FALL_Pos                  _U_(5)                                               /**< (HSMC_IMR) Ready Busy Falling Edge Detection Interrupt Mask Position */
#define HSMC_IMR_RB_FALL_Msk                  (_U_(0x1) << HSMC_IMR_RB_FALL_Pos)                   /**< (HSMC_IMR) Ready Busy Falling Edge Detection Interrupt Mask Mask */
#define HSMC_IMR_RB_FALL(value)               (HSMC_IMR_RB_FALL_Msk & ((value) << HSMC_IMR_RB_FALL_Pos))
#define HSMC_IMR_XFRDONE_Pos                  _U_(16)                                              /**< (HSMC_IMR) Transfer Done Interrupt Mask Position */
#define HSMC_IMR_XFRDONE_Msk                  (_U_(0x1) << HSMC_IMR_XFRDONE_Pos)                   /**< (HSMC_IMR) Transfer Done Interrupt Mask Mask */
#define HSMC_IMR_XFRDONE(value)               (HSMC_IMR_XFRDONE_Msk & ((value) << HSMC_IMR_XFRDONE_Pos))
#define HSMC_IMR_CMDDONE_Pos                  _U_(17)                                              /**< (HSMC_IMR) Command Done Interrupt Mask Position */
#define HSMC_IMR_CMDDONE_Msk                  (_U_(0x1) << HSMC_IMR_CMDDONE_Pos)                   /**< (HSMC_IMR) Command Done Interrupt Mask Mask */
#define HSMC_IMR_CMDDONE(value)               (HSMC_IMR_CMDDONE_Msk & ((value) << HSMC_IMR_CMDDONE_Pos))
#define HSMC_IMR_DTOE_Pos                     _U_(20)                                              /**< (HSMC_IMR) Data Timeout Error Interrupt Mask Position */
#define HSMC_IMR_DTOE_Msk                     (_U_(0x1) << HSMC_IMR_DTOE_Pos)                      /**< (HSMC_IMR) Data Timeout Error Interrupt Mask Mask */
#define HSMC_IMR_DTOE(value)                  (HSMC_IMR_DTOE_Msk & ((value) << HSMC_IMR_DTOE_Pos))
#define HSMC_IMR_UNDEF_Pos                    _U_(21)                                              /**< (HSMC_IMR) Undefined Area Access Interrupt Mask5 Position */
#define HSMC_IMR_UNDEF_Msk                    (_U_(0x1) << HSMC_IMR_UNDEF_Pos)                     /**< (HSMC_IMR) Undefined Area Access Interrupt Mask5 Mask */
#define HSMC_IMR_UNDEF(value)                 (HSMC_IMR_UNDEF_Msk & ((value) << HSMC_IMR_UNDEF_Pos))
#define HSMC_IMR_AWB_Pos                      _U_(22)                                              /**< (HSMC_IMR) Accessing While Busy Interrupt Mask Position */
#define HSMC_IMR_AWB_Msk                      (_U_(0x1) << HSMC_IMR_AWB_Pos)                       /**< (HSMC_IMR) Accessing While Busy Interrupt Mask Mask */
#define HSMC_IMR_AWB(value)                   (HSMC_IMR_AWB_Msk & ((value) << HSMC_IMR_AWB_Pos))  
#define HSMC_IMR_NFCASE_Pos                   _U_(23)                                              /**< (HSMC_IMR) NFC Access Size Error Interrupt Mask Position */
#define HSMC_IMR_NFCASE_Msk                   (_U_(0x1) << HSMC_IMR_NFCASE_Pos)                    /**< (HSMC_IMR) NFC Access Size Error Interrupt Mask Mask */
#define HSMC_IMR_NFCASE(value)                (HSMC_IMR_NFCASE_Msk & ((value) << HSMC_IMR_NFCASE_Pos))
#define HSMC_IMR_RB_EDGE0_Pos                 _U_(24)                                              /**< (HSMC_IMR) Ready/Busy Line 0 Interrupt Mask Position */
#define HSMC_IMR_RB_EDGE0_Msk                 (_U_(0x1) << HSMC_IMR_RB_EDGE0_Pos)                  /**< (HSMC_IMR) Ready/Busy Line 0 Interrupt Mask Mask */
#define HSMC_IMR_RB_EDGE0(value)              (HSMC_IMR_RB_EDGE0_Msk & ((value) << HSMC_IMR_RB_EDGE0_Pos))
#define HSMC_IMR_Msk                          _U_(0x01F30030)                                      /**< (HSMC_IMR) Register Mask  */

#define HSMC_IMR_RB_EDGE_Pos                  _U_(24)                                              /**< (HSMC_IMR Position) Ready/Busy Line x Interrupt Mask */
#define HSMC_IMR_RB_EDGE_Msk                  (_U_(0x1) << HSMC_IMR_RB_EDGE_Pos)                   /**< (HSMC_IMR Mask) RB_EDGE */
#define HSMC_IMR_RB_EDGE(value)               (HSMC_IMR_RB_EDGE_Msk & ((value) << HSMC_IMR_RB_EDGE_Pos)) 

/* -------- HSMC_ADDR : (SMC Offset: 0x18) (R/W 32) NFC Address Cycle Zero Register -------- */
#define HSMC_ADDR_ADDR_CYCLE0_Pos             _U_(0)                                               /**< (HSMC_ADDR) NAND Flash Array Address Cycle 0 Position */
#define HSMC_ADDR_ADDR_CYCLE0_Msk             (_U_(0xFF) << HSMC_ADDR_ADDR_CYCLE0_Pos)             /**< (HSMC_ADDR) NAND Flash Array Address Cycle 0 Mask */
#define HSMC_ADDR_ADDR_CYCLE0(value)          (HSMC_ADDR_ADDR_CYCLE0_Msk & ((value) << HSMC_ADDR_ADDR_CYCLE0_Pos))
#define HSMC_ADDR_Msk                         _U_(0x000000FF)                                      /**< (HSMC_ADDR) Register Mask  */


/* -------- HSMC_BANK : (SMC Offset: 0x1C) (R/W 32) Bank Address Register -------- */
#define HSMC_BANK_BANK_Pos                    _U_(0)                                               /**< (HSMC_BANK) Bank Identifier Position */
#define HSMC_BANK_BANK_Msk                    (_U_(0x1) << HSMC_BANK_BANK_Pos)                     /**< (HSMC_BANK) Bank Identifier Mask */
#define HSMC_BANK_BANK(value)                 (HSMC_BANK_BANK_Msk & ((value) << HSMC_BANK_BANK_Pos))
#define HSMC_BANK_Msk                         _U_(0x00000001)                                      /**< (HSMC_BANK) Register Mask  */


/* -------- HSMC_PMECCFG : (SMC Offset: 0x70) (R/W 32) PMECC Configuration Register -------- */
#define HSMC_PMECCFG_BCH_ERR_Pos              _U_(0)                                               /**< (HSMC_PMECCFG) Error Correcting Capability Position */
#define HSMC_PMECCFG_BCH_ERR_Msk              (_U_(0x7) << HSMC_PMECCFG_BCH_ERR_Pos)               /**< (HSMC_PMECCFG) Error Correcting Capability Mask */
#define HSMC_PMECCFG_BCH_ERR(value)           (HSMC_PMECCFG_BCH_ERR_Msk & ((value) << HSMC_PMECCFG_BCH_ERR_Pos))
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR2_Val   _U_(0x0)                                             /**< (HSMC_PMECCFG) 2 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR4_Val   _U_(0x1)                                             /**< (HSMC_PMECCFG) 4 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR8_Val   _U_(0x2)                                             /**< (HSMC_PMECCFG) 8 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR12_Val  _U_(0x3)                                             /**< (HSMC_PMECCFG) 12 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR24_Val  _U_(0x4)                                             /**< (HSMC_PMECCFG) 24 errors  */
#define   HSMC_PMECCFG_BCH_ERR_BCH_ERR32_Val  _U_(0x5)                                             /**< (HSMC_PMECCFG) 32 errors  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR2         (HSMC_PMECCFG_BCH_ERR_BCH_ERR2_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 2 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR4         (HSMC_PMECCFG_BCH_ERR_BCH_ERR4_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 4 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR8         (HSMC_PMECCFG_BCH_ERR_BCH_ERR8_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 8 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR12        (HSMC_PMECCFG_BCH_ERR_BCH_ERR12_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 12 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR24        (HSMC_PMECCFG_BCH_ERR_BCH_ERR24_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 24 errors Position  */
#define HSMC_PMECCFG_BCH_ERR_BCH_ERR32        (HSMC_PMECCFG_BCH_ERR_BCH_ERR32_Val << HSMC_PMECCFG_BCH_ERR_Pos) /**< (HSMC_PMECCFG) 32 errors Position  */
#define HSMC_PMECCFG_SECTORSZ_Pos             _U_(4)                                               /**< (HSMC_PMECCFG) Sector Size Position */
#define HSMC_PMECCFG_SECTORSZ_Msk             (_U_(0x1) << HSMC_PMECCFG_SECTORSZ_Pos)              /**< (HSMC_PMECCFG) Sector Size Mask */
#define HSMC_PMECCFG_SECTORSZ(value)          (HSMC_PMECCFG_SECTORSZ_Msk & ((value) << HSMC_PMECCFG_SECTORSZ_Pos))
#define   HSMC_PMECCFG_SECTORSZ_SECTORSZ0_Val _U_(0x0)                                             /**< (HSMC_PMECCFG) Use  512 Byte Sector in ECC Computation  */
#define   HSMC_PMECCFG_SECTORSZ_SECTORSZ1_Val _U_(0x1)                                             /**< (HSMC_PMECCFG) Use 1024 Byte Sector in ECC Computation  */
#define HSMC_PMECCFG_SECTORSZ_SECTORSZ0       (HSMC_PMECCFG_SECTORSZ_SECTORSZ0_Val << HSMC_PMECCFG_SECTORSZ_Pos) /**< (HSMC_PMECCFG) Use  512 Byte Sector in ECC Computation Position  */
#define HSMC_PMECCFG_SECTORSZ_SECTORSZ1       (HSMC_PMECCFG_SECTORSZ_SECTORSZ1_Val << HSMC_PMECCFG_SECTORSZ_Pos) /**< (HSMC_PMECCFG) Use 1024 Byte Sector in ECC Computation Position  */
#define HSMC_PMECCFG_PAGESIZE_Pos             _U_(8)                                               /**< (HSMC_PMECCFG) Number of Sectors in the Page Position */
#define HSMC_PMECCFG_PAGESIZE_Msk             (_U_(0x3) << HSMC_PMECCFG_PAGESIZE_Pos)              /**< (HSMC_PMECCFG) Number of Sectors in the Page Mask */
#define HSMC_PMECCFG_PAGESIZE(value)          (HSMC_PMECCFG_PAGESIZE_Msk & ((value) << HSMC_PMECCFG_PAGESIZE_Pos))
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC_Val _U_(0x0)                                             /**< (HSMC_PMECCFG) 1 sector for main area (512 or 1024 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC_Val _U_(0x1)                                             /**< (HSMC_PMECCFG) 2 sectors for main area (1024 or 2048 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC_Val _U_(0x2)                                             /**< (HSMC_PMECCFG) 4 sectors for main area (2048 or 4096 bytes)  */
#define   HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC_Val _U_(0x3)                                             /**< (HSMC_PMECCFG) 8 sectors for main area (4096 or 8192 bytes)  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_1SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /**< (HSMC_PMECCFG) 1 sector for main area (512 or 1024 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_2SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /**< (HSMC_PMECCFG) 2 sectors for main area (1024 or 2048 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_4SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /**< (HSMC_PMECCFG) 4 sectors for main area (2048 or 4096 bytes) Position  */
#define HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC   (HSMC_PMECCFG_PAGESIZE_PAGESIZE_8SEC_Val << HSMC_PMECCFG_PAGESIZE_Pos) /**< (HSMC_PMECCFG) 8 sectors for main area (4096 or 8192 bytes) Position  */
#define HSMC_PMECCFG_NANDWR_Pos               _U_(12)                                              /**< (HSMC_PMECCFG) NAND Write Access Position */
#define HSMC_PMECCFG_NANDWR_Msk               (_U_(0x1) << HSMC_PMECCFG_NANDWR_Pos)                /**< (HSMC_PMECCFG) NAND Write Access Mask */
#define HSMC_PMECCFG_NANDWR(value)            (HSMC_PMECCFG_NANDWR_Msk & ((value) << HSMC_PMECCFG_NANDWR_Pos))
#define HSMC_PMECCFG_SPAREEN_Pos              _U_(16)                                              /**< (HSMC_PMECCFG) Spare Enable Position */
#define HSMC_PMECCFG_SPAREEN_Msk              (_U_(0x1) << HSMC_PMECCFG_SPAREEN_Pos)               /**< (HSMC_PMECCFG) Spare Enable Mask */
#define HSMC_PMECCFG_SPAREEN(value)           (HSMC_PMECCFG_SPAREEN_Msk & ((value) << HSMC_PMECCFG_SPAREEN_Pos))
#define HSMC_PMECCFG_AUTO_Pos                 _U_(20)                                              /**< (HSMC_PMECCFG) Automatic Mode Enable Position */
#define HSMC_PMECCFG_AUTO_Msk                 (_U_(0x1) << HSMC_PMECCFG_AUTO_Pos)                  /**< (HSMC_PMECCFG) Automatic Mode Enable Mask */
#define HSMC_PMECCFG_AUTO(value)              (HSMC_PMECCFG_AUTO_Msk & ((value) << HSMC_PMECCFG_AUTO_Pos))
#define HSMC_PMECCFG_Msk                      _U_(0x00111317)                                      /**< (HSMC_PMECCFG) Register Mask  */


/* -------- HSMC_PMECCSAREA : (SMC Offset: 0x74) (R/W 32) PMECC Spare Area Size Register -------- */
#define HSMC_PMECCSAREA_SPARESIZE_Pos         _U_(0)                                               /**< (HSMC_PMECCSAREA) Spare Area Size Position */
#define HSMC_PMECCSAREA_SPARESIZE_Msk         (_U_(0x1FF) << HSMC_PMECCSAREA_SPARESIZE_Pos)        /**< (HSMC_PMECCSAREA) Spare Area Size Mask */
#define HSMC_PMECCSAREA_SPARESIZE(value)      (HSMC_PMECCSAREA_SPARESIZE_Msk & ((value) << HSMC_PMECCSAREA_SPARESIZE_Pos))
#define HSMC_PMECCSAREA_Msk                   _U_(0x000001FF)                                      /**< (HSMC_PMECCSAREA) Register Mask  */


/* -------- HSMC_PMECCSADDR : (SMC Offset: 0x78) (R/W 32) PMECC Start Address Register -------- */
#define HSMC_PMECCSADDR_STARTADDR_Pos         _U_(0)                                               /**< (HSMC_PMECCSADDR) ECC Area Start Address Position */
#define HSMC_PMECCSADDR_STARTADDR_Msk         (_U_(0x1FF) << HSMC_PMECCSADDR_STARTADDR_Pos)        /**< (HSMC_PMECCSADDR) ECC Area Start Address Mask */
#define HSMC_PMECCSADDR_STARTADDR(value)      (HSMC_PMECCSADDR_STARTADDR_Msk & ((value) << HSMC_PMECCSADDR_STARTADDR_Pos))
#define HSMC_PMECCSADDR_Msk                   _U_(0x000001FF)                                      /**< (HSMC_PMECCSADDR) Register Mask  */


