virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
/* -------- HSMC_ELIER : (SMC Offset: 0x514) ( /W 32) PMECC Error Location Interrupt Enable register -------- */
#define HSMC_ELIER_DONE_Pos                   _U_(0)                                               /**< (HSMC_ELIER) Computation Terminated Interrupt Enable Position */
#define HSMC_ELIER_DONE_Msk                   (_U_(0x1) << HSMC_ELIER_DONE_Pos)                    /**< (HSMC_ELIER) Computation Terminated Interrupt Enable Mask */
#define HSMC_ELIER_DONE(value)                (HSMC_ELIER_DONE_Msk & ((value) << HSMC_ELIER_DONE_Pos))
#define HSMC_ELIER_Msk                        _U_(0x00000001)                                      /**< (HSMC_ELIER) Register Mask  */


/* -------- HSMC_ELIDR : (SMC Offset: 0x518) ( /W 32) PMECC Error Location Interrupt Disable Register -------- */
#define HSMC_ELIDR_DONE_Pos                   _U_(0)                                               /**< (HSMC_ELIDR) Computation Terminated Interrupt Disable Position */
#define HSMC_ELIDR_DONE_Msk                   (_U_(0x1) << HSMC_ELIDR_DONE_Pos)                    /**< (HSMC_ELIDR) Computation Terminated Interrupt Disable Mask */
#define HSMC_ELIDR_DONE(value)                (HSMC_ELIDR_DONE_Msk & ((value) << HSMC_ELIDR_DONE_Pos))
#define HSMC_ELIDR_Msk                        _U_(0x00000001)                                      /**< (HSMC_ELIDR) Register Mask  */


/* -------- HSMC_ELIMR : (SMC Offset: 0x51C) ( R/ 32) PMECC Error Location Interrupt Mask Register -------- */
#define HSMC_ELIMR_DONE_Pos                   _U_(0)                                               /**< (HSMC_ELIMR) Computation Terminated Interrupt Mask Position */
#define HSMC_ELIMR_DONE_Msk                   (_U_(0x1) << HSMC_ELIMR_DONE_Pos)                    /**< (HSMC_ELIMR) Computation Terminated Interrupt Mask Mask */
#define HSMC_ELIMR_DONE(value)                (HSMC_ELIMR_DONE_Msk & ((value) << HSMC_ELIMR_DONE_Pos))
#define HSMC_ELIMR_Msk                        _U_(0x00000001)                                      /**< (HSMC_ELIMR) Register Mask  */


/* -------- HSMC_ELISR : (SMC Offset: 0x520) ( R/ 32) PMECC Error Location Interrupt Status Register -------- */
#define HSMC_ELISR_DONE_Pos                   _U_(0)                                               /**< (HSMC_ELISR) Computation Terminated Interrupt Status Position */
#define HSMC_ELISR_DONE_Msk                   (_U_(0x1) << HSMC_ELISR_DONE_Pos)                    /**< (HSMC_ELISR) Computation Terminated Interrupt Status Mask */
#define HSMC_ELISR_DONE(value)                (HSMC_ELISR_DONE_Msk & ((value) << HSMC_ELISR_DONE_Pos))
#define HSMC_ELISR_ERR_CNT_Pos                _U_(8)                                               /**< (HSMC_ELISR) Error Counter value Position */
#define HSMC_ELISR_ERR_CNT_Msk                (_U_(0x3F) << HSMC_ELISR_ERR_CNT_Pos)                /**< (HSMC_ELISR) Error Counter value Mask */
#define HSMC_ELISR_ERR_CNT(value)             (HSMC_ELISR_ERR_CNT_Msk & ((value) << HSMC_ELISR_ERR_CNT_Pos))
#define HSMC_ELISR_Msk                        _U_(0x00003F01)                                      /**< (HSMC_ELISR) Register Mask  */


/* -------- HSMC_SIGMA0 : (SMC Offset: 0x528) ( R/ 32) PMECC Error Location SIGMA 0 Register -------- */
#define HSMC_SIGMA0_SIGMA0_Pos                _U_(0)                                               /**< (HSMC_SIGMA0) Coefficient of degree 0 in the SIGMA polynomial Position */
#define HSMC_SIGMA0_SIGMA0_Msk                (_U_(0x3FFF) << HSMC_SIGMA0_SIGMA0_Pos)              /**< (HSMC_SIGMA0) Coefficient of degree 0 in the SIGMA polynomial Mask */
#define HSMC_SIGMA0_SIGMA0(value)             (HSMC_SIGMA0_SIGMA0_Msk & ((value) << HSMC_SIGMA0_SIGMA0_Pos))
#define HSMC_SIGMA0_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA0) Register Mask  */


/* -------- HSMC_SIGMA1 : (SMC Offset: 0x52C) (R/W 32) PMECC Error Location SIGMA 1 Register -------- */
#define HSMC_SIGMA1_SIGMA1_Pos                _U_(0)                                               /**< (HSMC_SIGMA1) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA1_SIGMA1_Msk                (_U_(0x3FFF) << HSMC_SIGMA1_SIGMA1_Pos)              /**< (HSMC_SIGMA1) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA1_SIGMA1(value)             (HSMC_SIGMA1_SIGMA1_Msk & ((value) << HSMC_SIGMA1_SIGMA1_Pos))
#define HSMC_SIGMA1_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA1) Register Mask  */


/* -------- HSMC_SIGMA2 : (SMC Offset: 0x530) (R/W 32) PMECC Error Location SIGMA 2 Register -------- */
#define HSMC_SIGMA2_SIGMA2_Pos                _U_(0)                                               /**< (HSMC_SIGMA2) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA2_SIGMA2_Msk                (_U_(0x3FFF) << HSMC_SIGMA2_SIGMA2_Pos)              /**< (HSMC_SIGMA2) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA2_SIGMA2(value)             (HSMC_SIGMA2_SIGMA2_Msk & ((value) << HSMC_SIGMA2_SIGMA2_Pos))
#define HSMC_SIGMA2_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA2) Register Mask  */


/* -------- HSMC_SIGMA3 : (SMC Offset: 0x534) (R/W 32) PMECC Error Location SIGMA 3 Register -------- */
#define HSMC_SIGMA3_SIGMA3_Pos                _U_(0)                                               /**< (HSMC_SIGMA3) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA3_SIGMA3_Msk                (_U_(0x3FFF) << HSMC_SIGMA3_SIGMA3_Pos)              /**< (HSMC_SIGMA3) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA3_SIGMA3(value)             (HSMC_SIGMA3_SIGMA3_Msk & ((value) << HSMC_SIGMA3_SIGMA3_Pos))
#define HSMC_SIGMA3_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA3) Register Mask  */


/* -------- HSMC_SIGMA4 : (SMC Offset: 0x538) (R/W 32) PMECC Error Location SIGMA 4 Register -------- */
#define HSMC_SIGMA4_SIGMA4_Pos                _U_(0)                                               /**< (HSMC_SIGMA4) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA4_SIGMA4_Msk                (_U_(0x3FFF) << HSMC_SIGMA4_SIGMA4_Pos)              /**< (HSMC_SIGMA4) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA4_SIGMA4(value)             (HSMC_SIGMA4_SIGMA4_Msk & ((value) << HSMC_SIGMA4_SIGMA4_Pos))
#define HSMC_SIGMA4_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA4) Register Mask  */


