virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
/* -------- HSMC_SIGMA5 : (SMC Offset: 0x53C) (R/W 32) PMECC Error Location SIGMA 5 Register -------- */
#define HSMC_SIGMA5_SIGMA5_Pos                _U_(0)                                               /**< (HSMC_SIGMA5) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA5_SIGMA5_Msk                (_U_(0x3FFF) << HSMC_SIGMA5_SIGMA5_Pos)              /**< (HSMC_SIGMA5) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA5_SIGMA5(value)             (HSMC_SIGMA5_SIGMA5_Msk & ((value) << HSMC_SIGMA5_SIGMA5_Pos))
#define HSMC_SIGMA5_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA5) Register Mask  */


/* -------- HSMC_SIGMA6 : (SMC Offset: 0x540) (R/W 32) PMECC Error Location SIGMA 6 Register -------- */
#define HSMC_SIGMA6_SIGMA6_Pos                _U_(0)                                               /**< (HSMC_SIGMA6) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA6_SIGMA6_Msk                (_U_(0x3FFF) << HSMC_SIGMA6_SIGMA6_Pos)              /**< (HSMC_SIGMA6) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA6_SIGMA6(value)             (HSMC_SIGMA6_SIGMA6_Msk & ((value) << HSMC_SIGMA6_SIGMA6_Pos))
#define HSMC_SIGMA6_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA6) Register Mask  */


/* -------- HSMC_SIGMA7 : (SMC Offset: 0x544) (R/W 32) PMECC Error Location SIGMA 7 Register -------- */
#define HSMC_SIGMA7_SIGMA7_Pos                _U_(0)                                               /**< (HSMC_SIGMA7) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA7_SIGMA7_Msk                (_U_(0x3FFF) << HSMC_SIGMA7_SIGMA7_Pos)              /**< (HSMC_SIGMA7) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA7_SIGMA7(value)             (HSMC_SIGMA7_SIGMA7_Msk & ((value) << HSMC_SIGMA7_SIGMA7_Pos))
#define HSMC_SIGMA7_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA7) Register Mask  */


/* -------- HSMC_SIGMA8 : (SMC Offset: 0x548) (R/W 32) PMECC Error Location SIGMA 8 Register -------- */
#define HSMC_SIGMA8_SIGMA8_Pos                _U_(0)                                               /**< (HSMC_SIGMA8) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA8_SIGMA8_Msk                (_U_(0x3FFF) << HSMC_SIGMA8_SIGMA8_Pos)              /**< (HSMC_SIGMA8) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA8_SIGMA8(value)             (HSMC_SIGMA8_SIGMA8_Msk & ((value) << HSMC_SIGMA8_SIGMA8_Pos))
#define HSMC_SIGMA8_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA8) Register Mask  */


/* -------- HSMC_SIGMA9 : (SMC Offset: 0x54C) (R/W 32) PMECC Error Location SIGMA 9 Register -------- */
#define HSMC_SIGMA9_SIGMA9_Pos                _U_(0)                                               /**< (HSMC_SIGMA9) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA9_SIGMA9_Msk                (_U_(0x3FFF) << HSMC_SIGMA9_SIGMA9_Pos)              /**< (HSMC_SIGMA9) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA9_SIGMA9(value)             (HSMC_SIGMA9_SIGMA9_Msk & ((value) << HSMC_SIGMA9_SIGMA9_Pos))
#define HSMC_SIGMA9_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_SIGMA9) Register Mask  */


/* -------- HSMC_SIGMA10 : (SMC Offset: 0x550) (R/W 32) PMECC Error Location SIGMA 10 Register -------- */
#define HSMC_SIGMA10_SIGMA10_Pos              _U_(0)                                               /**< (HSMC_SIGMA10) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA10_SIGMA10_Msk              (_U_(0x3FFF) << HSMC_SIGMA10_SIGMA10_Pos)            /**< (HSMC_SIGMA10) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA10_SIGMA10(value)           (HSMC_SIGMA10_SIGMA10_Msk & ((value) << HSMC_SIGMA10_SIGMA10_Pos))
#define HSMC_SIGMA10_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA10) Register Mask  */


/* -------- HSMC_SIGMA11 : (SMC Offset: 0x554) (R/W 32) PMECC Error Location SIGMA 11 Register -------- */
#define HSMC_SIGMA11_SIGMA11_Pos              _U_(0)                                               /**< (HSMC_SIGMA11) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA11_SIGMA11_Msk              (_U_(0x3FFF) << HSMC_SIGMA11_SIGMA11_Pos)            /**< (HSMC_SIGMA11) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA11_SIGMA11(value)           (HSMC_SIGMA11_SIGMA11_Msk & ((value) << HSMC_SIGMA11_SIGMA11_Pos))
#define HSMC_SIGMA11_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA11) Register Mask  */


/* -------- HSMC_SIGMA12 : (SMC Offset: 0x558) (R/W 32) PMECC Error Location SIGMA 12 Register -------- */
#define HSMC_SIGMA12_SIGMA12_Pos              _U_(0)                                               /**< (HSMC_SIGMA12) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA12_SIGMA12_Msk              (_U_(0x3FFF) << HSMC_SIGMA12_SIGMA12_Pos)            /**< (HSMC_SIGMA12) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA12_SIGMA12(value)           (HSMC_SIGMA12_SIGMA12_Msk & ((value) << HSMC_SIGMA12_SIGMA12_Pos))
#define HSMC_SIGMA12_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA12) Register Mask  */


/* -------- HSMC_SIGMA13 : (SMC Offset: 0x55C) (R/W 32) PMECC Error Location SIGMA 13 Register -------- */
#define HSMC_SIGMA13_SIGMA13_Pos              _U_(0)                                               /**< (HSMC_SIGMA13) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA13_SIGMA13_Msk              (_U_(0x3FFF) << HSMC_SIGMA13_SIGMA13_Pos)            /**< (HSMC_SIGMA13) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA13_SIGMA13(value)           (HSMC_SIGMA13_SIGMA13_Msk & ((value) << HSMC_SIGMA13_SIGMA13_Pos))
#define HSMC_SIGMA13_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA13) Register Mask  */


/* -------- HSMC_SIGMA14 : (SMC Offset: 0x560) (R/W 32) PMECC Error Location SIGMA 14 Register -------- */
#define HSMC_SIGMA14_SIGMA14_Pos              _U_(0)                                               /**< (HSMC_SIGMA14) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA14_SIGMA14_Msk              (_U_(0x3FFF) << HSMC_SIGMA14_SIGMA14_Pos)            /**< (HSMC_SIGMA14) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA14_SIGMA14(value)           (HSMC_SIGMA14_SIGMA14_Msk & ((value) << HSMC_SIGMA14_SIGMA14_Pos))
#define HSMC_SIGMA14_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA14) Register Mask  */


/* -------- HSMC_SIGMA15 : (SMC Offset: 0x564) (R/W 32) PMECC Error Location SIGMA 15 Register -------- */
#define HSMC_SIGMA15_SIGMA15_Pos              _U_(0)                                               /**< (HSMC_SIGMA15) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA15_SIGMA15_Msk              (_U_(0x3FFF) << HSMC_SIGMA15_SIGMA15_Pos)            /**< (HSMC_SIGMA15) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA15_SIGMA15(value)           (HSMC_SIGMA15_SIGMA15_Msk & ((value) << HSMC_SIGMA15_SIGMA15_Pos))
#define HSMC_SIGMA15_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA15) Register Mask  */


/* -------- HSMC_SIGMA16 : (SMC Offset: 0x568) (R/W 32) PMECC Error Location SIGMA 16 Register -------- */
#define HSMC_SIGMA16_SIGMA16_Pos              _U_(0)                                               /**< (HSMC_SIGMA16) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA16_SIGMA16_Msk              (_U_(0x3FFF) << HSMC_SIGMA16_SIGMA16_Pos)            /**< (HSMC_SIGMA16) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA16_SIGMA16(value)           (HSMC_SIGMA16_SIGMA16_Msk & ((value) << HSMC_SIGMA16_SIGMA16_Pos))
#define HSMC_SIGMA16_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA16) Register Mask  */


/* -------- HSMC_SIGMA17 : (SMC Offset: 0x56C) (R/W 32) PMECC Error Location SIGMA 17 Register -------- */
#define HSMC_SIGMA17_SIGMA17_Pos              _U_(0)                                               /**< (HSMC_SIGMA17) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA17_SIGMA17_Msk              (_U_(0x3FFF) << HSMC_SIGMA17_SIGMA17_Pos)            /**< (HSMC_SIGMA17) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA17_SIGMA17(value)           (HSMC_SIGMA17_SIGMA17_Msk & ((value) << HSMC_SIGMA17_SIGMA17_Pos))
#define HSMC_SIGMA17_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA17) Register Mask  */


/* -------- HSMC_SIGMA18 : (SMC Offset: 0x570) (R/W 32) PMECC Error Location SIGMA 18 Register -------- */
#define HSMC_SIGMA18_SIGMA18_Pos              _U_(0)                                               /**< (HSMC_SIGMA18) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA18_SIGMA18_Msk              (_U_(0x3FFF) << HSMC_SIGMA18_SIGMA18_Pos)            /**< (HSMC_SIGMA18) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA18_SIGMA18(value)           (HSMC_SIGMA18_SIGMA18_Msk & ((value) << HSMC_SIGMA18_SIGMA18_Pos))
#define HSMC_SIGMA18_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA18) Register Mask  */


/* -------- HSMC_SIGMA19 : (SMC Offset: 0x574) (R/W 32) PMECC Error Location SIGMA 19 Register -------- */
#define HSMC_SIGMA19_SIGMA19_Pos              _U_(0)                                               /**< (HSMC_SIGMA19) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA19_SIGMA19_Msk              (_U_(0x3FFF) << HSMC_SIGMA19_SIGMA19_Pos)            /**< (HSMC_SIGMA19) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA19_SIGMA19(value)           (HSMC_SIGMA19_SIGMA19_Msk & ((value) << HSMC_SIGMA19_SIGMA19_Pos))
#define HSMC_SIGMA19_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA19) Register Mask  */


/* -------- HSMC_SIGMA20 : (SMC Offset: 0x578) (R/W 32) PMECC Error Location SIGMA 20 Register -------- */
#define HSMC_SIGMA20_SIGMA20_Pos              _U_(0)                                               /**< (HSMC_SIGMA20) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA20_SIGMA20_Msk              (_U_(0x3FFF) << HSMC_SIGMA20_SIGMA20_Pos)            /**< (HSMC_SIGMA20) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA20_SIGMA20(value)           (HSMC_SIGMA20_SIGMA20_Msk & ((value) << HSMC_SIGMA20_SIGMA20_Pos))
#define HSMC_SIGMA20_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA20) Register Mask  */


/* -------- HSMC_SIGMA21 : (SMC Offset: 0x57C) (R/W 32) PMECC Error Location SIGMA 21 Register -------- */
#define HSMC_SIGMA21_SIGMA21_Pos              _U_(0)                                               /**< (HSMC_SIGMA21) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA21_SIGMA21_Msk              (_U_(0x3FFF) << HSMC_SIGMA21_SIGMA21_Pos)            /**< (HSMC_SIGMA21) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA21_SIGMA21(value)           (HSMC_SIGMA21_SIGMA21_Msk & ((value) << HSMC_SIGMA21_SIGMA21_Pos))
#define HSMC_SIGMA21_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA21) Register Mask  */


