virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
/* -------- HSMC_SIGMA22 : (SMC Offset: 0x580) (R/W 32) PMECC Error Location SIGMA 22 Register -------- */
#define HSMC_SIGMA22_SIGMA22_Pos              _U_(0)                                               /**< (HSMC_SIGMA22) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA22_SIGMA22_Msk              (_U_(0x3FFF) << HSMC_SIGMA22_SIGMA22_Pos)            /**< (HSMC_SIGMA22) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA22_SIGMA22(value)           (HSMC_SIGMA22_SIGMA22_Msk & ((value) << HSMC_SIGMA22_SIGMA22_Pos))
#define HSMC_SIGMA22_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA22) Register Mask  */


/* -------- HSMC_SIGMA23 : (SMC Offset: 0x584) (R/W 32) PMECC Error Location SIGMA 23 Register -------- */
#define HSMC_SIGMA23_SIGMA23_Pos              _U_(0)                                               /**< (HSMC_SIGMA23) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA23_SIGMA23_Msk              (_U_(0x3FFF) << HSMC_SIGMA23_SIGMA23_Pos)            /**< (HSMC_SIGMA23) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA23_SIGMA23(value)           (HSMC_SIGMA23_SIGMA23_Msk & ((value) << HSMC_SIGMA23_SIGMA23_Pos))
#define HSMC_SIGMA23_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA23) Register Mask  */


/* -------- HSMC_SIGMA24 : (SMC Offset: 0x588) (R/W 32) PMECC Error Location SIGMA 24 Register -------- */
#define HSMC_SIGMA24_SIGMA24_Pos              _U_(0)                                               /**< (HSMC_SIGMA24) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA24_SIGMA24_Msk              (_U_(0x3FFF) << HSMC_SIGMA24_SIGMA24_Pos)            /**< (HSMC_SIGMA24) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA24_SIGMA24(value)           (HSMC_SIGMA24_SIGMA24_Msk & ((value) << HSMC_SIGMA24_SIGMA24_Pos))
#define HSMC_SIGMA24_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA24) Register Mask  */


/* -------- HSMC_SIGMA25 : (SMC Offset: 0x58C) (R/W 32) PMECC Error Location SIGMA 25 Register -------- */
#define HSMC_SIGMA25_SIGMA25_Pos              _U_(0)                                               /**< (HSMC_SIGMA25) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA25_SIGMA25_Msk              (_U_(0x3FFF) << HSMC_SIGMA25_SIGMA25_Pos)            /**< (HSMC_SIGMA25) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA25_SIGMA25(value)           (HSMC_SIGMA25_SIGMA25_Msk & ((value) << HSMC_SIGMA25_SIGMA25_Pos))
#define HSMC_SIGMA25_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA25) Register Mask  */


/* -------- HSMC_SIGMA26 : (SMC Offset: 0x590) (R/W 32) PMECC Error Location SIGMA 26 Register -------- */
#define HSMC_SIGMA26_SIGMA26_Pos              _U_(0)                                               /**< (HSMC_SIGMA26) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA26_SIGMA26_Msk              (_U_(0x3FFF) << HSMC_SIGMA26_SIGMA26_Pos)            /**< (HSMC_SIGMA26) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA26_SIGMA26(value)           (HSMC_SIGMA26_SIGMA26_Msk & ((value) << HSMC_SIGMA26_SIGMA26_Pos))
#define HSMC_SIGMA26_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA26) Register Mask  */


/* -------- HSMC_SIGMA27 : (SMC Offset: 0x594) (R/W 32) PMECC Error Location SIGMA 27 Register -------- */
#define HSMC_SIGMA27_SIGMA27_Pos              _U_(0)                                               /**< (HSMC_SIGMA27) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA27_SIGMA27_Msk              (_U_(0x3FFF) << HSMC_SIGMA27_SIGMA27_Pos)            /**< (HSMC_SIGMA27) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA27_SIGMA27(value)           (HSMC_SIGMA27_SIGMA27_Msk & ((value) << HSMC_SIGMA27_SIGMA27_Pos))
#define HSMC_SIGMA27_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA27) Register Mask  */


/* -------- HSMC_SIGMA28 : (SMC Offset: 0x598) (R/W 32) PMECC Error Location SIGMA 28 Register -------- */
#define HSMC_SIGMA28_SIGMA28_Pos              _U_(0)                                               /**< (HSMC_SIGMA28) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA28_SIGMA28_Msk              (_U_(0x3FFF) << HSMC_SIGMA28_SIGMA28_Pos)            /**< (HSMC_SIGMA28) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA28_SIGMA28(value)           (HSMC_SIGMA28_SIGMA28_Msk & ((value) << HSMC_SIGMA28_SIGMA28_Pos))
#define HSMC_SIGMA28_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA28) Register Mask  */


/* -------- HSMC_SIGMA29 : (SMC Offset: 0x59C) (R/W 32) PMECC Error Location SIGMA 29 Register -------- */
#define HSMC_SIGMA29_SIGMA29_Pos              _U_(0)                                               /**< (HSMC_SIGMA29) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA29_SIGMA29_Msk              (_U_(0x3FFF) << HSMC_SIGMA29_SIGMA29_Pos)            /**< (HSMC_SIGMA29) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA29_SIGMA29(value)           (HSMC_SIGMA29_SIGMA29_Msk & ((value) << HSMC_SIGMA29_SIGMA29_Pos))
#define HSMC_SIGMA29_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA29) Register Mask  */


/* -------- HSMC_SIGMA30 : (SMC Offset: 0x5A0) (R/W 32) PMECC Error Location SIGMA 30 Register -------- */
#define HSMC_SIGMA30_SIGMA30_Pos              _U_(0)                                               /**< (HSMC_SIGMA30) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA30_SIGMA30_Msk              (_U_(0x3FFF) << HSMC_SIGMA30_SIGMA30_Pos)            /**< (HSMC_SIGMA30) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA30_SIGMA30(value)           (HSMC_SIGMA30_SIGMA30_Msk & ((value) << HSMC_SIGMA30_SIGMA30_Pos))
#define HSMC_SIGMA30_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA30) Register Mask  */


