virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMA5D27CLD2G_DFP/component/smc.h
/* -------- HSMC_SIGMA31 : (SMC Offset: 0x5A4) (R/W 32) PMECC Error Location SIGMA 31 Register -------- */
#define HSMC_SIGMA31_SIGMA31_Pos              _U_(0)                                               /**< (HSMC_SIGMA31) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA31_SIGMA31_Msk              (_U_(0x3FFF) << HSMC_SIGMA31_SIGMA31_Pos)            /**< (HSMC_SIGMA31) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA31_SIGMA31(value)           (HSMC_SIGMA31_SIGMA31_Msk & ((value) << HSMC_SIGMA31_SIGMA31_Pos))
#define HSMC_SIGMA31_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA31) Register Mask  */


/* -------- HSMC_SIGMA32 : (SMC Offset: 0x5A8) (R/W 32) PMECC Error Location SIGMA 32 Register -------- */
#define HSMC_SIGMA32_SIGMA32_Pos              _U_(0)                                               /**< (HSMC_SIGMA32) Coefficient of degree x in the SIGMA polynomial Position */
#define HSMC_SIGMA32_SIGMA32_Msk              (_U_(0x3FFF) << HSMC_SIGMA32_SIGMA32_Pos)            /**< (HSMC_SIGMA32) Coefficient of degree x in the SIGMA polynomial Mask */
#define HSMC_SIGMA32_SIGMA32(value)           (HSMC_SIGMA32_SIGMA32_Msk & ((value) << HSMC_SIGMA32_SIGMA32_Pos))
#define HSMC_SIGMA32_Msk                      _U_(0x00003FFF)                                      /**< (HSMC_SIGMA32) Register Mask  */


/* -------- HSMC_ERRLOC : (SMC Offset: 0x5AC) ( R/ 32) PMECC Error Location 0 Register -------- */
#define HSMC_ERRLOC_ERRLOCN_Pos               _U_(0)                                               /**< (HSMC_ERRLOC) Error Position within the Set {sector area, spare area} Position */
#define HSMC_ERRLOC_ERRLOCN_Msk               (_U_(0x3FFF) << HSMC_ERRLOC_ERRLOCN_Pos)             /**< (HSMC_ERRLOC) Error Position within the Set {sector area, spare area} Mask */
#define HSMC_ERRLOC_ERRLOCN(value)            (HSMC_ERRLOC_ERRLOCN_Msk & ((value) << HSMC_ERRLOC_ERRLOCN_Pos))
#define HSMC_ERRLOC_Msk                       _U_(0x00003FFF)                                      /**< (HSMC_ERRLOC) Register Mask  */


/* -------- HSMC_OCMS : (SMC Offset: 0x7A0) (R/W 32) Off Chip Memory Scrambling Register -------- */
#define HSMC_OCMS_SMSE_Pos                    _U_(0)                                               /**< (HSMC_OCMS) Static Memory Controller Scrambling Enable Position */
#define HSMC_OCMS_SMSE_Msk                    (_U_(0x1) << HSMC_OCMS_SMSE_Pos)                     /**< (HSMC_OCMS) Static Memory Controller Scrambling Enable Mask */
#define HSMC_OCMS_SMSE(value)                 (HSMC_OCMS_SMSE_Msk & ((value) << HSMC_OCMS_SMSE_Pos))
#define HSMC_OCMS_SRSE_Pos                    _U_(1)                                               /**< (HSMC_OCMS) NFC Internal SRAM Scrambling Enable Position */
#define HSMC_OCMS_SRSE_Msk                    (_U_(0x1) << HSMC_OCMS_SRSE_Pos)                     /**< (HSMC_OCMS) NFC Internal SRAM Scrambling Enable Mask */
#define HSMC_OCMS_SRSE(value)                 (HSMC_OCMS_SRSE_Msk & ((value) << HSMC_OCMS_SRSE_Pos))
#define HSMC_OCMS_Msk                         _U_(0x00000003)                                      /**< (HSMC_OCMS) Register Mask  */


/* -------- HSMC_KEY1 : (SMC Offset: 0x7A4) ( /W 32) Off Chip Memory Scrambling KEY1 Register -------- */
#define HSMC_KEY1_KEY1_Pos                    _U_(0)                                               /**< (HSMC_KEY1) Off Chip Memory Scrambling (OCMS) Key Part 1 Position */
#define HSMC_KEY1_KEY1_Msk                    (_U_(0xFFFFFFFF) << HSMC_KEY1_KEY1_Pos)              /**< (HSMC_KEY1) Off Chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define HSMC_KEY1_KEY1(value)                 (HSMC_KEY1_KEY1_Msk & ((value) << HSMC_KEY1_KEY1_Pos))
#define HSMC_KEY1_Msk                         _U_(0xFFFFFFFF)                                      /**< (HSMC_KEY1) Register Mask  */


/* -------- HSMC_KEY2 : (SMC Offset: 0x7A8) ( /W 32) Off Chip Memory Scrambling KEY2 Register -------- */
#define HSMC_KEY2_KEY2_Pos                    _U_(0)                                               /**< (HSMC_KEY2) Off Chip Memory Scrambling (OCMS) Key Part 2 Position */
#define HSMC_KEY2_KEY2_Msk                    (_U_(0xFFFFFFFF) << HSMC_KEY2_KEY2_Pos)              /**< (HSMC_KEY2) Off Chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define HSMC_KEY2_KEY2(value)                 (HSMC_KEY2_KEY2_Msk & ((value) << HSMC_KEY2_KEY2_Pos))
#define HSMC_KEY2_Msk                         _U_(0xFFFFFFFF)                                      /**< (HSMC_KEY2) Register Mask  */


/* -------- HSMC_WPMR : (SMC Offset: 0x7E4) (R/W 32) Write Protection Mode Register -------- */
#define HSMC_WPMR_WPEN_Pos                    _U_(0)                                               /**< (HSMC_WPMR) Write Protection Enable Position */
#define HSMC_WPMR_WPEN_Msk                    (_U_(0x1) << HSMC_WPMR_WPEN_Pos)                     /**< (HSMC_WPMR) Write Protection Enable Mask */
#define HSMC_WPMR_WPEN(value)                 (HSMC_WPMR_WPEN_Msk & ((value) << HSMC_WPMR_WPEN_Pos))
#define HSMC_WPMR_WPKEY_Pos                   _U_(8)                                               /**< (HSMC_WPMR) Write Protection Key Position */
#define HSMC_WPMR_WPKEY_Msk                   (_U_(0xFFFFFF) << HSMC_WPMR_WPKEY_Pos)               /**< (HSMC_WPMR) Write Protection Key Mask */
#define HSMC_WPMR_WPKEY(value)                (HSMC_WPMR_WPKEY_Msk & ((value) << HSMC_WPMR_WPKEY_Pos))
#define   HSMC_WPMR_WPKEY_PASSWD_Val          _U_(0x534D43)                                        /**< (HSMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0.  */
#define HSMC_WPMR_WPKEY_PASSWD                (HSMC_WPMR_WPKEY_PASSWD_Val << HSMC_WPMR_WPKEY_Pos)  /**< (HSMC_WPMR) Writing any other value in this field aborts the write operation of bit WPEN.Always reads as 0. Position  */
#define HSMC_WPMR_Msk                         _U_(0xFFFFFF01)                                      /**< (HSMC_WPMR) Register Mask  */


